import { Component } from '@angular/core';

@Component({
  selector: 'app-culture',
  templateUrl: './culture.component.html',
  styleUrl: './culture.component.scss',
})
export class CultureComponent {
  data: any = [
    {
      url: '../../assets/images/culture/culture1.webp',
      title: 'Введенська церква',
      description:
        "У селі Поляниця, що розташована у Буковелі, знаходиться одна із найцікавіших історичних пам'яток — Введенська церква, яка побудована з дерева. Поблизу цього архітектурного шедевра розташовані могили військових, які загинули під час Першої світової війни. Особливості цього храму в його величних куполах та неповторному архітектурному ансамблі. Фото не може передати всю красу цієї будови, тому церква варта того, щоб приїхати та побачити її на власні очі. Вона була збудована у 1912 році, а остання реставрація відбулася у 1990.",
    },
    {
      url: '../../assets/images/culture/culture2.webp',
      title: 'Замок Потоцьких',
      description:
        "У Львові розташоване одне із див ХІХ століття  — Замок Потоцьких, що приваблює вишуканою архітектурою. У цьому палаці особливо вражає настінний живопис, ліпнина, фантастичної краси барельєфи та вітражі. Інтер'єр першого поверху виконаний у стилі епохи Луї XVI — дзеркала, позолота, мармурові каміни. Також у палаці розташована каплиця з чудотворною Львівською іконою Богородиці. На другому поверсі можна побачити зали античного мистецтва з полотнами видатних художників. ",
    },
    {
      url: '../../assets/images/culture/culture3.webp',
      title: 'Австрійський віадук',
      description:
        "У Ворохті можна побачити один з найдовших мостів у Європі — австрійський віадук. Його будівництво завершили у 1895 році. Міст пролягає через річку Прут. Його довжина становить 130 метрів, а ширина прольоту — 65. Ця кам'яна арка зачаровує відвідувачів, хоча вже не використовується для руху потягів. Також у Ворохті є інші старовинні віадуки. Вони не такі популярні, але не менш цікаві.",
    },
    {
      url: '../../assets/images/culture/culture4.webp',
      title: 'Тустанська фортеця',
      description:
        "У селі Урич розташована унікальна природна пам'ятка архітектури — Тустанська фортеця. У XII столітті вона була побудована з каменю та дерева. Щорічно тут проводяться фестивалі, де можна спостерігати за поєдинками лицарів. Ці місця приваблюють не лише любителів пейзажів та природи, а й адреналіну, тому що тут можна займатися альпінізмом. ",
    },
  ];
}
