import { Component } from '@angular/core';

@Component({
  selector: 'app-tourism',
  templateUrl: './tourism.component.html',
  styleUrl: './tourism.component.scss',
})
export class TourismComponent {
  data: any = [
    {
      url: '../../assets/images/tourism/tourism1.jpg',
      title: 'Яремче – місто-столиця туризму на Прикарпатті',
      description:
        'Це мальовниче містечко розташоване на березі водойми Прут, а точніше в гірській улоговині. Яремче – невеличке, але затишне місце. Місту ще не має й трьохсот років, але воно вже здобуло собі славу столиці Прикарпаття. Тут можна побачити на власні очі багато традиційного, відчути справжній гуцульський дух й поринути в культуру мальовничого краю. Вражає також й колористика міста – воно різнобарвне пістряве та яскраве. Тут легко поєднуються вікові традиції з сучасними віяннями. У цьому містечку можна легко віднайти собі відпочинок по душі. Місцеві мешканці завжди відкриті до того, щоб допомогти та підказати. Не втрачайте можливості поговорити з ними по душах, щоб дізнатися більше про особливість краю та життя у ньому. Саме відпочиваючи у Яремче поринаєш в особливу атмосферу свята та вікової мудрості життя, котра вчить не квапитися й насолоджуватися життям. Тут поважають свого ближнього, вміють дбати про природу й довколишнє середовище. Рекомендуємо відвідати Яремче у період великих релігійних свят. Саме тоді місто перетворюється на театральне яскраве дійство, де кожен знає що робити. Такий відпочинок запам’ятається надовго, оскільки дає змогу повністю поринути у світ Гуцульщини. Варто також відзначити, що сюди добре приїжджати з сім’єю, де є маленькі діти, адже тут є все для комфортного відпочинку.',
    },
    {
      url: '../../assets/images/tourism/tourism2.jpg',
      title: 'Поляниця – місце незабутнього відпочинку',
      description: 'До речі, село належить до Яремчанської міської ради. Модерне, сучасне, комфортне та затишне – саме ці епітети найкраще характеризують це село. Поляниця відома насамперед тим, що тут знаходиться найвідоміший гірськолижний курорт на теренах нашої країни – Буковель. Вражає те, що тут надзвичайно чисто та прибрано незважаючи на те, що це провінція. Саме у цих місцях можна здійснити велопрогулянку своєї мрії.'
    },
    {
      url: '../../assets/images/tourism/tourism3.jpg',
      title: 'Яблуниця – мальовниче карпатське село',
      description: 'Яблуниця – селище з такою «смачною» назвою розташоване на відстані 35 км від Яремча. Через те, що тут панує помірно холодна зимова погода узимку, снігове покривало зберігається протягом шести місяців. У Яблуниці є безліч схилів для катання на лижах, тому взимку це поселення користується великим попитом серед любителів активного відпочинку. Саме село начебто заховане у казковому місці, адже з усіх сторін його оточують горді та неприступні Карпати. Особливо красиво тут улітку, адже повітря переповнене п’янкими ароматами трав та квітів, а схили гір укриті барвистим килимком. Вражає також і те, що у цих краях дихається дуже вільно, адже чисте карпатське повітря сприяє швидкому оздоровленню людського організму. Іноді здається, що кращого місця й годі шукати. Такі вони, Карпати – особливі та по-своєму привабливі. У Яблуницю, після першого разу, неодмінно захочеться приїжджати ще.'
    },
    {
      url: '../../assets/images/tourism/tourism4.jpg',
      title: 'Косів – колиска Гуцульщини',
      description: 'Подейкують, що Косів – то частина раю. Насправді легенди не обманюють, бо край багатий на різні красоти, котрі чарують надовго. Наприклад, тут займаються садівництвом та бджільництвом, а ще місцеві майстри виготовляють найзручніший у світі посуд та килими, різноманітне кухонне начиння, побутові речі, варять екологічне мило та багато іншого. Косів – це жива енциклопедія народно-прикладного мистецтва. Тут можна багато чому навчитися, скуштувати та привезти з собою. Про красу краю влучно сказано в поетичних рядках:'
    },
    {
      url: '../../assets/images/tourism/tourism5.jpg',
      title: 'Верховина – місце, де народжується казка',
      description: 'Тут живуть чудові привітні люди з співочою душею. Це місце надзвичайно відкрите й, водночас, містичне. Є якась неймовірна магія, котра розлита скрізь у поселенні. Краса цього краю надихала й продовжує надихати митців на створення шедеврів мистецтва. Наприклад, режисер культової стрічки «Тіні забутих предків», Сергій Параджанов пройнявшись краєм та його природою, вирішив зняти про це фільм. Про святкування свят у цьому краї ходять легенди. Тутешні жителі настільки полюбляють свята, що готові цілий тиждень святкувати весілля. Весілля у Верховині – це коли усі ґазди та ґаздині дістають з скринь свій барвистий святковий одяг, а саме свято відбувається з дотриманням усіх давніх традицій. Побувати на такому весіллі – це те саме, що відвідати фестиваль з живим акторами. У Верховині знають чим дивувати: тут можна й погуляти у лісі, скупатися у гуцульських чанах, відвідати музеї з цікавими експозиціями та інші місця сили.'
    },
    {
      url: '../../assets/images/tourism/tourism6.jpg',
      title: 'Шешори − срібний курорт Гуцульщини',
      description: 'У Карпатах на мандрівника завжди чекає хороший та затишний відпочинок. Місць, куди можна поїхати безліч, але тих, котрі варто відвідати насамперед трохи менше. Шешори – справді розкішне поселення в Косівському районі. Цей курорт впевнено займе високе місце на теренах нашої країни та є відомим за її межами. Від свіжого гірського повітря може запаморочитися в голові, а запахи створять винятково піднесений настрій. У Шешорах мандрівника на світанку розбудить спів пташок, вдень зігріє лагідне сонячне проміння. Навколишня природа та гармонія допоможуть духовно та фізично зцілитися. Втрачене «я» віднайти на лоні природи буде значно легше, аніж, скажімо, у бетонних нетрях мегаполісу. Взимку відпочинок у Шешорах буде не менш драйвовим, адже тут є спеціально об лаштовані місця для зручного катання. Тут точно не буде скучно! Також варто спробувати смачну карпатську кухню, адже всі страви приготовані з екологічно чистих продуктів, що значно посприяє вашому оздоровленню.'
    },
    {
      url: '../../assets/images/tourism/tourism7.jpg',
      title: 'Курортний відпочинок у Східниці',
      description: 'Мінеральна вода «Нафтуся» відома багатьом завдяки своїм лікувальним властивостям. Її батьківщина – Львівська область, Дрогобицький район, село Східниця. Саме поселення розташоване у широкій долині, поруч протікає невелика гірська річечка. Відвідати цей курорт реабілітологи рекомендують насамперед пацієнтам з захворюваннями печінки, нирок, малокрів\'ї, солевому діатезі та цукровому діабеті. Цілюща вода допомагає у лікуванні усіх цих хвороб та сприяє нормалізації кислотності шлунку. Доведено, що вода допомагає у регенерації клітин, тобто омолоджує їх, через що й здобула у народі звання «живої води». До речі, курорт Східниця – це понад 38 джерел та 17 свердловин. Окрім води, тут також є лікувальні грязі. Селище знане не тільки на теренах України, а й за її межами, оскільки в радянські часи тут оздоровлювалося надзвичайно багато людей з усіх республік. У селищі доволі гарно розвинена туристична інфраструктура, тобто тут можна зняти житло, враховуючи побажання свого гаманця. Загалом відпочинок у Східниці – цінне вкладення у ваше здоров’я. Це те, що запам’ятовується на роки.'
    },
    {
      url: '../../assets/images/tourism/tourism8.jpg',
      title: 'Місто Сколе',
      description: 'Місто Сколе – це історична столиця Бойківщини, яка розташована у Львівській області. Саме місто невелике за розмірами, затишне та спокійне. Поселення занесене до списку історичних населених міст України, адже тут зосереджена велика кількість архітектурних та природних об’єктів важливого значення. Поселення з усіх сторін оточене різними за висотою гордими вершинами. Здається, що начебто воно у казанку. Завдяки цьому, тут затишно у холодну пору року. У Сколе надзвичайно комфортно відпочивати цілою сім’єю, адже цьому сприяє помірний клімат. Відпочинок у Сколе – це романтичні піші прогулянки, прогулянки на велосипеді, купання у водоймах, підкорення вершин та багато іншого. Тим, кому подобається активний відпочинок – Сколе припаде до душі!'
    },
    {
      url: '../../assets/images/tourism/tourism9.jpg',
      title: 'Село Пилипець',
      description: 'Курорт Пилипець – одне з найбільших поселень району, високогірне село, де розташований відомий курорт. Найбільшою популярністю ці місця користуються взимку, адже саме у цю пору тут багато любителів екстриму. Варто зазначити, що для комфортного катання тут є абсолютно усе: облаштовані траси (загальна протяжність – 20 км) та 7 витягів. Найдовша траса має довжину 7 км. Також тут неважко підшукати собі житло, адже у поселенні туристична інфраструктура знаходиться на належному рівні. До послуг мандрівника – готелі, садиби, колиби, ресторани, пункти прокату туристичного спорядження та інше. Користується популярністю також проживання у приватному секторі, що є значно економніше та й цікавіше, бо спілкуючись з місцевими, дізнаєшся багато нового та пізнавального про край, звичаї, побут та людей.'
    },
    {
      url: '../../assets/images/tourism/tourism10.jpg',
      title: 'Село Шаян',
      description: 'Це закарпатське курортне селище здавна знане своїми мінеральними джерелами. До речі, на основі цілющої карпатської джерельної води було створено одну із найдавніших купалень Мармароські жупи. Місцевій воді приписують лікувальні властивості й недарма, адже вона здатна вилікувати кишечник, виразку шлунку, позбутися урологічних захворювань. Також вода надзвичайно допомагає при очищенні людського організму загалом. Експерти говорять про те, що місцева вода нічим не поступається відомим лікувальним водам − «Боржомі», «Нарзан», «Єсентукі». Курорт зустрічає багатьма готелями та ресторанами, котрі підійдуть будь-якому гаманцю та смаку. Живописна природа, навколишня чистота, екологічність – це те, що допоможе відновити втрачені сили та по-новому поглянути у майбутнє. Відпочивати у Карпатах – здорово!'
    }
  ];
}
