import { Component } from '@angular/core';

@Component({
  selector: 'app-high-places',
  templateUrl: './high-places.component.html',
  styleUrl: './high-places.component.scss',
})
export class HighPlacesComponent {
  data: any = [
    {
      url: '../../assets/images/home/picture1.jpeg',
      title: 'Говерла (2061 м)',
      description:
        'Гора Говерла – найвища точка не тільки Українських Карпат, а й України. Вершина знаходиться у гірському масиві Чорногора, більша частина якого –  на території Карпатського біосферного заповідника та Карпатського національного природного парку. Розташована Говерла на межі Рахівського району Закарпатської області та Надвірнянського району Івано-Франківщини, за 17 км від румунського кордону. Овіяна численними переказами та легендами, ця вершина – одна з улюблених серед тих, хто відправляється в похід Чорногірським хребтом. Це найвідоміша гора країни. Багато українців своє знайомство з карпатськими горами починають саме з Говерли. Назва гори, за переказами, означає «засніжена вершина» або «важкопрохідне підвищення». За формою Говерла нагадує правильний конус. Вона покрита чагарниками, альпійськими луками, а на вершині – переважно кам’яними розсипами та брилами. З невеликого плоского майданчика на вершині Говерли відкриваються величні краєвиди Чорногірського хребта.',
    },
    {
      url: '../../assets/images/home/picture2.jpg',
      title: 'Бребенескул (2035 м)',
      description:
        'Гора Бребенескул – друга вершина України, яка також є частиною Чорногірського хребта.  Ця куполоподібна гора розташована на межі Івано-Франківської та Закарпатської областей. Бребенескул має древньо-льодові форми рельєфу та сліди морозного вивітрювання. Сріблясті снігові шати на ній можна побачити навіть влітку. На схилі гори Бребенескул можна побачити мальовниче найвисокогірніше озеро нашої країни, яке також називається Бребенескул (1801 м). Це вишуканий витвір природи, і вважається гідрологічною пам’яткою.',
    },
    {
      url: '../../assets/images/home/picture3.jpeg',
      title: 'Піп Іван Чорногірський (2028 м)',
      description:
        'Піп Іван Чорногірський (2028 м) Назва гори походить від скелі на її вершині, що нагадувала священника в рясі. На жаль, тепер цієї скелі немає, тому перевірити це не можливо. З вершини відкривається надзвичайний панорамний вид на весь Чорногірський хребет. Неподалік вершини знаходиться будівля метеорологічно-астрономічної обсерваторії, яку тут облаштували поляки в далекому 1938 році. Сьогодні ці залишки є туристичним об’єктом, та називаються «Білий слон». Особливо мальовничим Піп Іван стає взимку, коли сніги огортають обсерваторію. Варто зазначити, що обсерваторія «Білий слон» – це найвища в Україні будівля – де жили і працювали люди.',
    },
    {
      url: '../../assets/images/home/picture4.jpeg',
      title: 'Петрос (2020 м)',
      description:
        'Ця гора з крутими кам᾿янистими схилами. Західний і південно-західний схили – з численними розсипами каміння, північний та північно-східний  –  урвисті, зі скельними виступами.  Петрос часто називають грозовою вершиною: у непогоду сюди часто б᾿ють блискавки, дмуть суворі вітри. Гора не рідко оповита хмарами, а штормовий вітер скручує встановлені металеві захисні огорожі. Шлях сюди важкий, але з вершини розгортаються чарівні краєвиди: звідси видно Говерлу та Піп Іван. З головною вершиною Українських Карпат   Петрос повязаний перемичкою – сідловиною.  Здолавші її, ви знайдете затишний будинок лісівників, де можна відпочити, набратися сил перед штурмом  Говерли. Як правило, сходження на Петрос починаються з сіл Кваси та Лазещина, що у Рахівському районі.',
    },
    {
      url: '../../assets/images/home/picture5.jpg',
      title: 'Гутин Томнатик (2016 м)',
      description:
        'Перераховуючи наймальовничіші вершини Карпат, варто згадати і Гутин Томнатик, який лише трохи нижчий за гору Петрос і також розташований на Чорногірському хребті.  На північно-східному схилі, між Гутин Томнатиком та горою Бребенескул, на висоті 1801 метр над рівнем моря розташувалось озеро Бребенескул – найвисокогірніше озеро України.  Тут багато рідкісних  реліктових видів рослин, а погода сприятливіша, ніж на горі Петрос.',
    },
    {
      url: '../../assets/images/home/picture6.jpg',
      title: 'Ребра (2001 м)',
      description:
        'Ця гора знаходиться в центральній частині Чорногірського хребта, а навколо неї –  гори Туркул, Бребенескул та Гутин Томнатик. На заході від вершини є декілька невеликих високогірних озер. Особливо эффектно Ребра виглядають влітку: схили, вкриті килимом зелених трав, порізані гострими скельними виступами, що нагадують ребра. Тут можна побачити залишки старовинних укріплень, включаючи окопи, марковані стовпчики. Саме по Ребрах колись проходив Польсько-Чехословацький кордон. На вершину веде п᾿ять туристичних маршрутів, тому ви можете обрати найзручнійший для себе.',
    },
    {
      url: '../../assets/images/home/picture7.jpg',
      title: 'Менчул (1998 м)',
      description:
        'Цій вершині забракло зовсім небагато, щоб увійти до числа двотисячників. Вона розташована між горами Бребенескул та Дземброня і є частиною Чорногірського хребта. Назва Менчул походить з румунської (munteul), та означає «гора».   Схили Менчула пологі. З Менчула починається гірський хребет Розшибеник. Потрапити у цей край можна за маршрутом із села Говерла. Також сюди веде стежка, що пролягає через гору Бребенескул.',
    },
    {
      url: '../../assets/images/home/picture8.jpg',
      title: 'Піп Іван Мармароський (1936 м)',
      description:
        'Гора Піп Іван Мармароський є найвищою вершиною Мармароського масиву (Марамарошу). Мармароські або Рахівські гори – один з наймальовничіших і важкодоступніших гірських масивів Карпат, вершинам якого притаманний типово альпійський рельєф. Потужні скельні виходи, численні обриви, значні перепади висот, гострі стрімкі вершини, глибокі долини, дрімучі праліси, квітучі полонини,  чисті потоки, високогірні озера надають схожості українським Мармаросам і європейським Альпам. Цей гірський хребет розділяє Україну і Румунію і по ньому пролягає кордон між цими країнами. Побувати в Мармаросах та підкорити вершину Піп Іван Мармароський мріють багато туристів. Туди дістатися трохи складно і далеко. Але цілком реально!',
    },
    {
      url: '../../assets/images/home/picture9.jpg',
      title: 'Туркул (1933 м)',
      description:
        'Гора з трикутною вершиною та східцеподібними схилами знаходиться на Чорногорсьому хребті. Назва гори походить, можливо, від давньої карпатської назви сніжного бика. Розташована на межі Закарпатської та Івано-Франківської областей. З вершини гори відкривається дивовижний краєвид на Чорногірський хребет.  Туркул є популярним туристичним об’єктом: біля нього знаходиться прісна водойма  –  озеро Несамовите, одне з найвідоміших карпатських озер, біля якого проходять майже всі туристичні маршрути по Чорногорському хребту.',
    },
  ];
}
